Autodesk.Revit.DB.Structure.LoadCase.IsNumberUnique(Autodesk.Revit.DB.Document,System.Int32)
Checks that a given number is unique among all load cases.
number:
The number to check.
Returns:
True if the given number is unique among all load cases, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.Structure.LoadCase.IsLoadNatureId(Autodesk.Revit.DB.ElementId)
Checks whether provided element ID refer to LoadNature element.
natureId:
The ID to check.
Returns:
True if the ID refers to LoadNature element, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.Structure.LoadCase.IsLoadCaseSubcategoryId(Autodesk.Revit.DB.ElementId)
Checks whether provided element ID refer to subcategory of Structural Load Cases (Autodesk.Revit.DB.BuiltInCategory.OST_LoadCases) category - one of built-in or user defined.
Remarks:
Built-in structural Load Cases (Autodesk.Revit.DB.BuiltInCategory.OST_LoadCases) subcategories are:
Autodesk.Revit.DB.BuiltInCategory.OST_LoadCasesDeadAutodesk.Revit.DB.BuiltInCategory.OST_LoadCasesLiveAutodesk.Revit.DB.BuiltInCategory.OST_LoadCasesWindAutodesk.Revit.DB.BuiltInCategory.OST_LoadCasesSnowAutodesk.Revit.DB.BuiltInCategory.OST_LoadCasesRoofLiveAutodesk.Revit.DB.BuiltInCategory.OST_LoadCasesAccidentalAutodesk.Revit.DB.BuiltInCategory.OST_LoadCasesTemperatureAutodesk.Revit.DB.BuiltInCategory.OST_LoadCasesSeismic
loadCaseSubcategoryId:
The ID to check.
Returns:
True if the ID refers to load case category element, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.Structure.LoadCase.Create(Autodesk.Revit.DB.Document,System.String,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a new LoadCase.
Remarks:
This method is designed to create LoadCase that is associated with user defined category.
document:
The Document to which new load case element will be added.
name:
The name of the load case.
natureId:
The load nature ID.
subcategoryId:
The load case subcategory ID. Could be one of predefined or user defined load case category.
Built-in structural Load Cases (Autodesk.Revit.DB.BuiltInCategory.OST_LoadCases) subcategories are:
Autodesk.Revit.DB.BuiltInCategory.OST_LoadCasesDeadAutodesk.Revit.DB.BuiltInCategory.OST_LoadCasesLiveAutodesk.Revit.DB.BuiltInCategory.OST_LoadCasesWindAutodesk.Revit.DB.BuiltInCategory.OST_LoadCasesSnowAutodesk.Revit.DB.BuiltInCategory.OST_LoadCasesRoofLiveAutodesk.Revit.DB.BuiltInCategory.OST_LoadCasesAccidentalAutodesk.Revit.DB.BuiltInCategory.OST_LoadCasesTemperatureAutodesk.Revit.DB.BuiltInCategory.OST_LoadCasesSeismic
Returns:
The newly created load case element if successful, null otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given name is not unique.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Structure.LoadCase.Create(Autodesk.Revit.DB.Document,System.String,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Structure.LoadCaseCategory)
Creates a new LoadCase.
Remarks:
This method is designed to create LoadCase that is associated with one of the predefined category.
document:
The Document to which new load case element will be added.
name:
The name of the load case.
natureId:
The load nature ID.
loadCaseCategory:
The predefined load case category.
Returns:
The newly created load case element if successful, null otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given name is not unique.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.DB.Structure.LoadCase.Number
Returns unique load case number.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given number is not unique.
Since:
2016

Autodesk.Revit.DB.Structure.LoadCase.SubcategoryId
Build-in or user defined subcategory of Structural Load Cases (Autodesk.Revit.DB.BuiltInCategory.OST_LoadCases) category.
Remarks:
Build-in Structural Load Cases (Autodesk.Revit.DB.BuiltInCategory.OST_LoadCases) subcategories are:
Autodesk.Revit.DB.BuiltInCategory.OST_LoadCasesDeadAutodesk.Revit.DB.BuiltInCategory.OST_LoadCasesLiveAutodesk.Revit.DB.BuiltInCategory.OST_LoadCasesWindAutodesk.Revit.DB.BuiltInCategory.OST_LoadCasesSnowAutodesk.Revit.DB.BuiltInCategory.OST_LoadCasesRoofLiveAutodesk.Revit.DB.BuiltInCategory.OST_LoadCasesAccidentalAutodesk.Revit.DB.BuiltInCategory.OST_LoadCasesTemperatureAutodesk.Revit.DB.BuiltInCategory.OST_LoadCasesSeismic
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: the subcategoryId does not refer to predefined nor user defined load case category element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Structure.LoadCase.NatureId
The nature ID of the load case.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: the natureId does not refer to LoadNature element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.Structure.LoadCase
An object that represents a load usage.